UKS/src/Catalogs/Оборудование/Оборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Оборудование</name>
  <comment>Оборудование</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИнвентарныйНомер</name>
    <comment>Инвентарныйномер</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Размещение</name>
    <comment>Размещение</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИПАдрес</name>
    <comment>ИП адрес принтера</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <comment>Логин</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <comment>Пароль</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <comment>Изготвитель</comment>
    <type>
      <types>CatalogRef.Изготовители</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОборудования</name>
    <comment>Вид оборудования</comment>
    <type>
      <types>CatalogRef.ВидыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриобритения</name>
    <comment>Дата покупки оборудования</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Списан</name>
    <comment>Списан</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСписания</name>
    <comment>Дата списания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

UKS/src/CommonModules/ОбщегоНазначения/Module.bsl
&НаСервере
Функция ПолучитьДень(ИсходнаяДата, КоличествоПрибавляемыхДней)
	
	Запрос = Новый("
	|ВЫБРАТЬ 
	|ДОБАВИТЬКДАТЕ(&ИсходнаяДата, ДЕНЬ, &Количество) как Дата");

	Запрос.УстановитьПараметр("ИсходнаяДата", ИсходнаяДата); 
	Запрос.УстановитьПараметр("Количество", КоличествоПрибавляемыхДней); 
	Возврат Запрос.Выполнить().Выгрузить()[0].Дата;
	
КонецФункции

&НаСервере
Функция ПолучитьОписаниеОборудования(Ссылка) Экспорт
	
	Запрос = Новый ("
	|ВЫБРАТЬ
	|	Оборудование.Ссылка КАК Ссылка,
	|	Оборудование.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	Оборудование.Наименование КАК Наименование,
	|	Оборудование.Размещение КАК Размещение
	|ИЗ
	|	Справочник.Оборудование КАК Оборудование
	|ГДЕ
	|	Оборудование.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	ОборудованиеСсылка = Запрос.Выполнить().Выгрузить();
	
	Возврат "Инв. ном "+ОборудованиеСсылка.ИнвентарныйНомер+" - "+ОборудованиеСсылка.Наименование+" (каб. "+ОборудованиеСсылка.Размещение+")";
КонецФункции
